# โจทย์ ให้คุณเขียนโปรแกรมที่ทำงานดังนี้

#ให้ลูปจากเลข 1 ถึง 50
#ถ้าเลขนั้นหารด้วย 3 ลงตัว ให้บวก 5 เข้าไปในตัวแปร total
#ถ้าเลขนั้นหารด้วย 5 ลงตัว ให้ลบ 2 ออกจากตัวแปร total
#ถ้าเลขนั้นหารทั้ง 3 และ 5 ลงตัว ให้คูณ 3 กับตัวแปร total

# ตัวแปรบวก - ลบ
plus_total = 0

# ตัวแปรคูณ
multi_total = 1

# ลูปจาก 1 ถึง 50 หาค่าที่หารด้วย 3 ซ้อน if หาร 5 ลงตัว และรวมผลไว้ใน plus_total
for num in range(1, 51):    # ลูปทำงานกับตัวเลขจาก 1 ถึง 50
    if num % 3 == 0:        # จะเลือกเฉพาะตัวเลขที่หารด้วย 3 ลงตัว
        plus_total += 5     # แล้วบวก +5 เข้าไปในตัวแปร plus_total

    if num % 5 == 0:        # จะเลือกเฉพาะตัวเลขที่หารด้วย 5 ลงตัว
        plus_total -= 2     # แล้วลบ -2 เข้าไปในตัวแปร plus_total

    if num % 3 == 0 and num % 5 == 0: # จะเลือกเฉพาะตัวเลขที่หารด้วย 3 ลงตัว และ 5 ลงตัว
        multi_total *= 3                # แล้วคูณ *3 เข้าไปในตัวแปร multi_total

print(plus_total)   # แสดงผลรวมของตัวเลขที่หารด้วย 3 ลงตัว
print(multi_total)  # แสดงผลคูณของตัวเลขที่หารด้วยทั้ง 3 และ 5 ลงตัว

        

