#ลูปจากเลข 1 ถึง 100
#ถ้าเลขนั้นหารด้วย 2 ลงตัวและหารด้วย 5 ลงตัว ให้บวก 100
#ถ้าเลขนั้นหารด้วย 3 ลงตัวและหารด้วย 7 ลงตัว ให้บวก 75
#ถ้าเลขนั้นหารด้วย 6 ลงตัวและไม่หารด้วย 9 ให้บวก 50
#ถ้าเลขนั้นหารด้วย 9 ลงตัว แต่ไม่หารด้วย 3 หรือ 6 ให้บวก 30
#ถ้าเลขนั้นหารด้วย 11 ลงตัว แต่ไม่หารด้วย 2 ให้บวก 20
#ถ้าเลขนั้นไม่หารด้วย 2, 3, 5, 7, 9, 11 ลงตัว ให้บวก 10

total = 0

for num in range(1, 101):
    if num % 2 == 0 and num % 5 == 0:
        total += 100
    elif num % 3 == 0 and num % 7 == 0:
        total += 75
    elif num % 6 == 0 and num % 9 != 0:
        total += 50
    elif num % 9 == 0 and num % 3 != 0 and num % 6 != 0:
        total += 30
    elif num % 11 == 0 and num % 2 != 0:
        total += 20
    else:
        total += 10        

print(total)



