# ตัวแปรบวก
plus_total = 0

# ตัวแปรคูณ
multi_total = 1

# ลูปจาก 1 ถึง 200 หาค่าที่หารด้วย 5 ลงตัว และรวมผลไว้ใน plus_total
for num in range(1, 201):   # ลูปทำงานกับตัวเลขจาก 1 ถึง 200
    if num % 5 == 0:        # จะเลือกเฉพาะตัวเลขที่หารด้วย 5 ลงตัว
        plus_total += num   # แล้วนำตัวเลขเหล่านั้นมารวมกันในตัวแปร plus_total

    if num % 5 == 0 and num % 10 == 0:  # จะเลือกเฉพาะตัวเลขที่หารด้วย 5 ลงตัว
        multi_total *= num  # แล้วนำตัวเลขเหล่านั้นมารวมกันในตัวแปร multi_total

print(plus_total)   # แสดงผลคูณของตัวเลขที่หารด้วยทั้ง 5 ลงตัว
print(multi_total)  # แสดงผลคูณของตัวเลขที่หารด้วยทั้ง 5 และ 10 ลงตัว
   




        