# โจทย์1 ให้เขียนโปรแกรมที่ทำงานดังนี้:

#วนลูปตัวเลขจาก 1 ถึง 30
#ถ้าเลขนั้นหารด้วย 4 ลงตัว: ให้บวก 10 เข้าไปในตัวแปร total
#ถ้าเลขนั้นหารด้วย 6 ลงตัว: ให้บวก 15 เข้าไปในตัวแปร total
#ถ้าเลขนั้นหารทั้ง 4 และ 6 ลงตัว: ให้บวก 25 เข้าไปในตัวแปร total
#แสดงค่า total หลังจบลูป

# ตัวแปร +
plus_total = 0

# Process Loop
for num in range(1, 30):                # ลูปการทำงานของตัวเลข 1 ถึง 30   
    if num % 4 == 0 and num % 6 ==0:    # เลือกเฉพาะตัวเลขที่หาร 4 และ 6 ลงตัว
        plus_total += 25                # แล้วบวก +25 เข้าไปในตัวแปร
    elif num % 4 == 0:                  # เลือกเฉพาะตัวเลขที่หาร 4 ลงตัว
        plus_total += 10                # แล้วบวก +10 เข้าไปในตัวแปร
    elif num % 6 == 0:                  # เลือกเฉพาะตัวเลขที่ 6 ลงตัว
        plus_total += 15                # แล้วบวก +15 เข้าไปในตัวแปร

print(plus_total)                       #แสดงผลบวกของตัวเลขที่หาร 4 และ 6 ลงตัว    


#โจทย์ 2 ให้ลูปจากเลข 1 ถึง 40 และทำดังนี้:

#ถ้าเลขนั้นหารด้วย 2 ลงตัว ให้บวก 5 เข้าไปในตัวแปร total
#ถ้าเลขนั้นหารด้วย 3 ลงตัว ให้ลบ 3 ออกจากตัวแปร total
#ถ้าเลขนั้นหารด้วยทั้ง 2 และ 3 ลงตัว ให้คูณ 2 กับตัวแปร total
#ถ้าเลขนั้นหารด้วย 7 ลงตัว ให้บวก 10 เข้าไปในตัวแปร total

#ตัวแปรบวก + - ลบ
plus_total = 0

#ตัวแปรคูณ * / หาร
multi_total = 1

for num in range(1, 40):
    if num % 2 == 0 and num % 3 == 0:
        multi_total *= 2
    
    elif num % 2 == 0:
        plus_total += 5
    elif num % 3 == 0:
        plus_total -= 3
    elif num % 7 == 0:
        plus_total += 10

print(multi_total)
print(plus_total)        




       



    




