# โจทย์ 1: ให้ลูปจาก 1 ถึง 30 และทำดังนี้:
#ถ้าเลขนั้นหารด้วย 2 ลงตัว ให้บวก 10 เข้าไปในตัวแปร total
#ถ้าเลขนั้นหารด้วย 3 ลงตัว ให้บวก 20 เข้าไปในตัวแปร total

# ตัวแปรบวก
plus_total = 0

# ลูปจาก 1 ถึง 30 หาค่าที่หารด้วย 2 และ 3 ลงตัว และรวมผลไว้ใน plus_total
for num in range(1, 31):    # ลูปการทำงานกับตัวเลข 1 ถึง 30
    if num % 2 == 0:        # จะเลือกเฉพาะตัวเลขที่หารด้วย 2 ลงตัว
        plus_total += 10    # แล้วบวก +10 เข้าไปในตัวแปร plus_total

    if num % 3 == 0:        # จะเลือกเฉพาะตัวเลขที่หารด้วย 3 ลงตัว
        plus_total += 20    # แล้วบวก +20 เข้าไปในตัวแปร plus_total

print(plus_total)                    
        
