# สร้างเกมที่ให้ผู้ใช้ทายหมายเลขที่ระบบสุ่มขึ้น
# สร้างหมายเลขสุ่มระหว่าง 1 ถึง 100
# ให้ผู้ใช้ทายหมายเลข
# แสดงผลว่าผู้ใช้ทายถูกหรือผิด

import random       # นำเข้าโมดูล แรนด้อม

random_number = random.randint(1, 100)  # ระบบจะสร้างตัวเลขและเก็บไว้ที่ตัวแปร โดยใช้โมดูลแรนด้อม
guess = None                            # สร้างตัวแปรเดาเลข และกำหนดเป็นไม่มีค่า

while guess != random_number:           # สร้างลูปกำหนด การเดาจนกว่าจะเดา random_number ที่ระบบกำหนดถูก
    guess = int(input("ใส่ตัวเลขที่คุณต้องการสุ่ม ระหว่าง(1-100): ")) # สร้าง input และให้ user กรอกตัวเลขเพื่อเดา

    if guess < random_number:           # ถ้าเงื่อนไข เลขที่เดา น้อยกว่า ตัวเลขที่ระบบสุ่ม จะทำงาน
        print("น้อยเกินไป")               # แสดงผลลัพธ์ น้อยเกินไป หากเข้าเงื่อนไข
    elif guess > random_number:         # ถ้าเงื่อนไข เลขที่เดา มากกว่า ตัวเลขที่ระบบสุ่ม จะทำงาน
        print("มากเกินไป")               # แสดงผลลัพธ์ มากเกินไป หากเข้าเงื่อนไข
    else:                               # ถ้าตัวเลขที่เดา ตรงกับ ตัวเลขที่ระบบสุ่มมา จะทำงาน
        print("คุณทายถูกต้อง")            # แสดงผลลัพธ์ คุณทายถูกต้อง
