num = []        # ประกาศตัวแปรมาเก็บค่าใน list
total = 0       # ค่าเริ่มต้นอยู่ที่ 0 (ไม่มีค่า)

# Process
while True:     # ประกาศลูป โดยใช้ While ให้ลูปไปเรื่อยๆ
    try:                                             # ประกาศ คำสั่งเช็ค เพื่อเช็ค block code นี้
        number = int(input("โปรดป้อนตัวเลขของคุณ: "))  # ประกาศตัวแปรและรับ input จากผู้ใช้
        if number == 0:                              # ประกาศเงื่อนไข ให้มันเช็ค และกำหนดว่าถ้าผู้ใช้ป้อนค่าเข้ามาถูกจะเป็น True จะทำงานในบรรทัดถัดไป
            break                                    # เมื่อ บรรทัด if เป็น True บรรทัดนี้จะทำงาน โดยจะหยุดการลูป ทั้งหมด
        num.append(number)                           # ประกาศ เม็ทตอท ให้มันเก็บค่าจาก inputผู้ใช้ ไปไว้ใน list
    except ValueError:                               # ประกาศ คำสั่งเช็ค เพื่อเช็ค ว่ามีผู้ใช้ป้อนข้อมูลที่ไม่ใช่ตัวเลขไหม   
        print("กรุณาป้อนเฉพาะตัวเลขเท่านั้น: ")            # แจ้งให้ผู้ใช้ทราบเมื่อ ป้อนค่าที่ไม่ใช่ตัวเลข                            

for numbers in num:                                  # ประกาศลูป และประกาศตัวแปร เพื่อเช็คใน list และนำมาเก็บไว้อีกทีที่ตัวแปรที่สร้างใหม่
    total += numbers                                 # ประกาศตัวแปร ที่จะทำการแสดงผลลัพธ์

print(f"ผลรวมของตัวเลขที่ป้อนคือ: {total}")              # ผลลัพธ์