# สร้างระบบฟอร์มที่ผู้ใช้กรอกชื่อและอีเมล์ และบันทึกข้อมูลลงใน list เพื่อแสดงข้อมูล
# ให้ผู้ใช้กรอกชื่อและอีเมล์
# บันทึกข้อมูลใน list
# แสดงข้อมูลที่ผู้ใช้กรอก

contacts = []   # สร้างตัวแปรที่เป็น ลิส

while True:     #infinite loop
    name = input("โปรดป้อนชื่อของคุณ: ")    # รับชื่อจากผู้ใช้
    email = input("โปรดป้อน Email ของคุณ: ")  # รับอีเมลจากผู้ใช้
    contacts.append([name, email])  # เก็บข้อมูล input ลงไปใน list

    more = input("ถ้าต้องการเพิ่มข้อมูลเพิ่มเติมให้พิมพ์ (Yes/No): ") # ถามผู้ใช้ว่าต้องการเพิ่มข้อมูลไหม ถ้าพิมพ์ no จะหยุดลูปทันที
    if more.lower() == "no":    # เงื่อนไขที่ต้องการตรวจสอบถ้าพิมพ์ว่า No ไม่ว่าจะเล็กใหญ่ก็จะสิ้นสุดลูป
        break   # คำสั่งหยุดลูป

print("ข้อมูลของคุณ")  # แสดงผล
for info in contacts:   # ใช้ for เช็คค่าที่ก็บไว้ใน ตัวแปร list ทีละตัว
    print(f"ชื่อ: {info[0]}, อีเมล: {info[1]}") # แสดงผลลัพธ์ 

        










