# To-Do List
# สร้างโปรแกรมที่สามารถเพิ่มรายการใน To-Do List และแสดงรายการที่เพิ่มเข้าไป
# สร้างลูปที่ให้ผู้ใช้สามารถเพิ่มรายการได้
# แสดงรายการทั้งหมดที่เพิ่มเข้าไป
# ให้ผู้ใช้เลือกที่จะหยุดเมื่อไม่ต้องการเพิ่มรายการแล้ว

todo_lis = []       # สร้างตัวแปรเพื่อเก็บลิส

while True:         # ลูปที่ทำงานไม่มีที่สิ้นสุด ให้เงื่อนไขเป็นจริงเสมอ จนกว่าจะเจอ คำสั่งให้หยุด
    task = input("โปรดป้อนกิจกรรมของคุณ ถ้าไม่มีแล้วให้พิมพ์(quit): ") # สร้างตัวแปรเก็บ Input ผู้ใช้
    if task.lower() == "quit":      # ตรวจว่า input ที่ป้อนเข้ามาตรง กับแปลงเป็นตัวเล็กและ ตรงกับ string ที่ถูกต้องหรือไม่
        break                       # เมื่อเงื่อนไขด้านบนป้อน quit ลูปจะหยุดทำงาน 
    todo_lis.append(task)           # เมื่อผู้ใช้ป้อนกิจกรรม และคำที่ไม่ใช่ quit จะถูกเก็บไว้ในตัวแปรลิสต์ 

print("กิจกรรมที่จะทำก็คือ")            # เมื่อลูปหยุดทำงาน จะแสดงผลข้อความนี้ออกมา
for task in todo_lis:               # ใช้ลูปวนค่าที่อยู่ใน todo_list และเช็คข้อมูลของ task ที่ได้รับมา
    print(f"- {task}")              # แสดงผลลัพธ์ทั้งหมด



        
        





